/*--------------------------------------------------------------------------------------------------------------------------------------------------------------
Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
----------------------------------------------------------------------------------------------------------------------------------------------------------------
09.05.2022	konstantin@5277.ru			Начало
--------------------------------------------------------------------------------------------------------------------------------------------------------------*/
package common;

import enums.EMnemonic;
import main.Line;
import main.ProgInfo;

public class Mnemonic {
	
	public static void parse(ProgInfo l_pi, Line l_line, EMnemonic l_em, String l_value) {
		//TODO
	}
}
