/*--------------------------------------------------------------------------------------------------------------------------------------------------------------
Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
----------------------------------------------------------------------------------------------------------------------------------------------------------------
11.05.2022	konstantin@5277.ru			Начало
--------------------------------------------------------------------------------------------------------------------------------------------------------------*/
package JAObjects;

import main.Line;
import main.ProgInfo;

public class JAUndef extends JAObject {
	private	String	name;
	
	public JAUndef(ProgInfo l_pi, Line l_line) {
		name = l_line.get_value().trim().toLowerCase();
		l_pi.remove_register(name);
	}
}
