/*--------------------------------------------------------------------------------------------------------------------------------------------------------------
Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
----------------------------------------------------------------------------------------------------------------------------------------------------------------
09.03.2022	konstantin@5277.ru			Начало
--------------------------------------------------------------------------------------------------------------------------------------------------------------*/
package main;

import java.util.LinkedList;

public class Macros {
	private	String				name;
	private	LinkedList<Line>	body	= new LinkedList<>();
	
	public Macros(String l_name) {
		name = l_name;
	}
	
	public LinkedList<Line> get_body() {
		return body;
	}
}
