/*--------------------------------------------------------------------------------------------------------------------------------------------------------------
Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
----------------------------------------------------------------------------------------------------------------------------------------------------------------
09.03.2022	konstantin@5277.ru			Начало
--------------------------------------------------------------------------------------------------------------------------------------------------------------*/
package main;

import java.util.LinkedList;

public class SegmentInfo {
	private	LinkedList<ORGInfo> orglist	= new LinkedList<>();
	
	public LinkedList<ORGInfo> get_orglist() {
		return orglist;
	}
}
